In [1]:
import pandas as pd

In [2]:
data = {

    "name": ["Atharv", "Arjun" , "Prakash", "Rajiv"],
    "age": [21,22,43,21],
    "weight": [60,45,67,89],
    "DIV": ["A","B", "C", "D"]
    
}

df = pd.DataFrame(data)
df

      name  age  weight DIV
0   Atharv   21      60   A
1    Arjun   22      45   B
2  Prakash   43      67   C
3    Rajiv   21      89   D

In [3]:
df.shape

(4, 4)

In [4]:
df.size

16

In [5]:
df.values

array([['Atharv', 21, 60, 'A'],
       ['Arjun', 22, 45, 'B'],
       ['Prakash', 43, 67, 'C'],
       ['Rajiv', 21, 89, 'D']], dtype=object)

In [6]:
df.memory_usage()

Index     132
name       32
age        32
weight     32
DIV        32
dtype: int64

In [7]:
df.T

             0      1        2      3
name    Atharv  Arjun  Prakash  Rajiv
age         21     22       43     21
weight      60     45       67     89
DIV          A      B        C      D

In [8]:
df.sort_index()

      name  age  weight DIV
0   Atharv   21      60   A
1    Arjun   22      45   B
2  Prakash   43      67   C
3    Rajiv   21      89   D

In [9]:
df.describe()

             age     weight
count   4.000000   4.000000
mean   26.750000  65.250000
std    10.843585  18.300729
min    21.000000  45.000000
25%    21.000000  56.250000
50%    21.500000  63.500000
75%    27.250000  72.500000
max    43.000000  89.000000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   weight  4 non-null      int64
 3   DIV     4 non-null      object
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes

In [11]:
df.nunique()

name      4
age       3
weight    4
DIV       4
dtype: int64

In [12]:
df.head(2)

     name  age  weight DIV
0  Atharv   21      60   A
1   Arjun   22      45   B

In [13]:
df.tail(2)

      name  age  weight DIV
2  Prakash   43      67   C
3    Rajiv   21      89   D

In [14]:
x = df.loc[0, "name"]
x

'Atharv'

In [15]:
x = df["weight"].mean()
x

np.float64(65.25)

In [16]:
y = df["weight"].median()
y

np.float64(63.5)

In [17]:
z = df["weight"].mode()
z

0    45
1    60
2    67
3    89
Name: weight, dtype: int64

In [18]:
a = df["weight"].std()
a

np.float64(18.300728582946274)

In [19]:
df.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [20]:
df.drop_duplicates()

      name  age  weight DIV
0   Atharv   21      60   A
1    Arjun   22      45   B
2  Prakash   43      67   C
3    Rajiv   21      89   D

In [23]:
data2 = {
    
    "DIV": ["A","B","C","D"],
    "Sex": ["Male", "Male", "Male", "Male "]
}

df2 = pd.DataFrame(data2)
df2

  DIV    Sex
0   A   Male
1   B   Male
2   C   Male
3   D  Male

In [24]:
merge = pd.merge(df,df2)
merge

      name  age  weight DIV    Sex
0   Atharv   21      60   A   Male
1    Arjun   22      45   B   Male
2  Prakash   43      67   C   Male
3    Rajiv   21      89   D  Male